# Pandas Turtorial
* pandas is use to handle tabalar data,
<a href='https://www.youtube.com/watch?v=5_QXMwezPJE&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&index=2'>video</a>

In [2]:
import pandas as pd

### About read Tables  <a href='http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_table.html'>hit</a>

In [21]:
#read perfect data,a DataFrame obj
chipotle=pd.read_table('../AI_database/others/chipotle.tsv',sep='\t')
print(type(chipotle))

<class 'pandas.core.frame.DataFrame'>

In [19]:
#add column name to dataset
cols=['id','age','gender','occupation/job','zip code']
user=pd.read_table('../AI_database/others/u.user',sep='|',names=cols,skiprows=3)

In [22]:
user.head()

   id  age gender occupation/job zip code
0   4   24      M     technician    43537
1   5   33      F          other    15213
2   6   42      M      executive    98101
3   7   57      M  administrator    91344
4   8   36      M  administrator    05201

## How do I select a pandas Series from a DataFrame?
* A series is nothing but a series of columns

In [48]:
ufo=pd.read_csv('../AI_database/others/ufo.csv',names=['City','colors','shape','state','Time'],skiprows=1)

In [53]:
type(ufo['City']+','+ufo['state'])

pandas.core.series.Series

In [54]:
ufo['location']=ufo['City']+','+ufo['state']

In [55]:
ufo.head()

,City,colors,shape,state,Time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

##  Some property about Dataframe
* ###   .describe
* ###   .shape
* ###   .dtype

In [61]:
imdb=pd.read_csv('../AI_database/others/imdb_1000.csv')
imdb.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [66]:
print('shape',imdb.shape,'\ntype:\n',imdb.dtypes)

shape (979, 6)
type:
 star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [60]:
imdb.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000